#+title: Machine Learning: algorithms, Code lecture 3
#+subtitle: Data reading and regression
#+author: Nicky van Foreest
#+date: \today


#+STARTUP: overview
#+OPTIONS:  toc:1 H:2

# +include: preamble_presentation.org
#+include: preamble_handout.org


** Solving for the makespan


Now that we have graph, we want to compute the completion time of ~Cmax~. For this we model the problem as an LP.

We begin with loading ~pulp~, a python library to solve LPs. Then we create a problem, to which we add decision variables, contrainsts, and an objective.

#+name:problem
#+begin_src python :session :results none :exports both
prob = pulp.LpProblem("Critical_Path_Problem", pulp.LpMinimize)
#+end_src


As for the  decision variables, each job \(j\) has  a starting time $s_{j}$ and a completion time $c_{j}$, for $j=1,\ldots, n$.

#+name: decisions
#+begin_src python :session :results none :exports both
all_nodes = [j for j in cpm.nodes()]
s = pulp.LpVariable.dicts("s", all_nodes, 0)  # start
c = pulp.LpVariable.dicts("c", all_nodes, 0)  # completion
#+end_src
The $0$ (the last attribute) constrains the variables to non-negative values.


Now we implement  the constraints. For each  job $j$, its completion time $c_{j}$ must be larger than its starting time $s_{j}$ plus its  processing time $p_{j}$:
\begin{equation*}
   c_j \geq s_j + p_j, \quad \text{for } j=1,\ldots, n.
\end{equation*}

#+name: own_completion
#+begin_src python :session :results none :exports both
for j in cpm.nodes():
    prob += c[j] >= s[j] + cpm.nodes[j]['p']
#+end_src
(Observe that the python code is very similar to the maths.)

Next,  a job can only start after all its predecessors are finished:
\begin{equation*}
   s_j  \geq s_i+p_i, \text{ for all } i \to j,
\end{equation*}
where we write $i\to j$ to mean that job $i$ precedes job $j$.

#+name: start
#+begin_src python :session :results none :exports both
for j in cpm.nodes():
    for i in cpm. predecessors(j):
        prob += s[j] >= s[i] + cpm.nodes[i]['p']
#+end_src
Observe here we that the ~DiGraph~ class of ~networkx~ provides us with a function to compute the predessorcs. We get it for free!


Finally, a job's completion time must be larger than the completion times of each of its predecessors plus its own processing time:
\begin{equation*}
   c_j \geq c_i + p_j, \text{ for all } i \to j.
\end{equation*}

#+name: completion
#+begin_src python :session :results none :exports both
for j in cpm.nodes():
    for i in cpm. predecessors(j):
        prob += c[j]  >= c[i] + cpm.nodes[j]['p']
#+end_src
Observe that the constraint $C_{\max} \geq c_j$ is automaticaly included by these constraints, as `Cmax` is a node in the project graph.


The objective function is such that the makespan is minimized and,  simultaneously, that the earliest starting times are minimized and latest completion times are maximized.
With this we can find the slack of task $j$ as $c_j-s_j - p_{j}$. Knowing the slack is important: any job with zero slack is /tight/, which means that it's on the /critical path/. Any detail on a tight job will result in a delay of the entire project. Hence, it's essential to manage the tight jobs well, so as to prevent delay.

We thereforex define the objective function as
\begin{align*}
   \min\left\{ C_{max} + \epsilon \sum_{j=1}^n s_j - \epsilon \sum_{j=1}^n c_j \right\},
\end{align*}
where $\epsilon$ is some small number, and $n$ is the number of tasks.

#+name: objective
#+begin_src python :session :results none :exports both
eps = 1e-5
prob += (
    c["Cmax"]
    + eps * pulp.lpSum([s[j] for j in cpm.nodes()])
    - eps * pulp.lpSum([c[j] for j in cpm.nodes()])
)
#+end_src

Solving is now very simple. We can just call ~solve~ to have the LP built, and solved.

#+name: solve
#+begin_src python :session :results none :exports both
prob.writeLP("cpmLP.lp")
prob.solve()
pulp.LpStatus[prob.status]
#+end_src

Let's check the status:
#+begin_src python :session :results value :exports both
pulp.LpStatus[prob.status]
#+end_src

#+RESULTS:
: Optimal

This is good news: the problem is solved to optimality.

Here are the earliest starting, completion times, and slacks. All jobs that have zero slack are in the critical path.


#+begin_src python :session :results output :exports both
for j in cpm.nodes():
    print(
        j, s[j].varValue, c[j].varValue, c[j].varValue - s[j].varValue - cpm.nodes[j]['p']
    )
#+end_src

#+RESULTS:
#+begin_example
1 0.0 5.0 0.0
2 5.0 12.0 1.0
3 5.0 14.0 0.0
4 11.0 24.0 1.0
5 14.0 26.0 5.0
6 14.0 26.0 0.0
7 23.0 34.0 1.0
8 26.0 36.0 4.0
9 26.0 36.0 0.0
10 33.0 43.0 1.0
11 36.0 43.0 0.0
12 43.0 51.0 0.0
13 43.0 51.0 1.0
14 51.0 56.0 0.0
Cmax 56.0 56.0 0.0
#+end_example

The project completion time is $56$ time units.

** A test

Since classes definitions themselves are also objects, we can pass them to test functions, such as I do below.
(Here is subtle point, a class definition is not the same as an /instantion/ of a class.
An instantiation of a class is an object with real data in it while a class is a template that specifies how the objects should behave.
A class definition is also an object in python, but /not/ an instantiation of the class.)

#+begin_src python :session :results none :exports code
def test(method):
    np.random.seed(3)

    n, p = 50, 20
    sigma = 5

    beta_star = np.ones(p)
    beta_star[:10] = np.zeros(10)

    X = np.random.randn(n, p)
    Y = X @ beta_star + np.random.normal(0, sigma, size=n)

    algo = method(X, Y, gamma=1)
    algo.solve()
    print(algo.beta[0])
#+end_src


#+begin_src python :session :results output :exports both
test(OLS)
test(OLS_convex)
#+end_src

#+RESULTS:
: 0.7362515517803382
: 0.7362515517803384


Note that I compare  my `new' tool ~CVXPY~ against my `old' tool ~numpy.linalg.solve~.
Perhaps you find me a bit over cautious, but from experience I can tell you that if you forget (or are too lazy) to do such steps, you can be confronted with very awkward surprises.
Such intermediate checks help to locate mistakes that I might make later.
In case errors occur later, it's unlikely I have to search for the problem in the points above.


** A test

I can use the earlier test function right away.
#+begin_src python :session :results output  :exports both
test(Ridge)
test(Ridge_convex)
#+end_src

#+RESULTS:
: 0.6839570416892673
: 0.6837994245619745

